lib/mine_sweeper_board.rb

INSERT INTO "boards" ("name", "email", "height", "width", "num_mines", "board_data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def call
    @board = Board.new(params)
    @board.board_data = board_data_with_mines
    @board.save!